
Процедура Телегрм() Экспорт
	
	Выборка = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ответ = ВыполнитьPOSTЗапрос(Выборка.ВКМ_ТекстСообщения);
		
		Если Ответ.КодСостояния = 200 Тогда
		
		    ВыборкаОбъект = Выборка.ПолучитьОбъект();
			ВыборкаОбъект.Удалить(); 
			
		Иначе
		
			ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
			ЗаписьЖурналаРегистрации(ТекстОшибки);
			
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыполнитьPOSTЗапрос(ТекстСообщения)
	
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

	Источник = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", Токен, ИдентификаторГруппы, ТекстСообщения)  ;
	                    
	HTTPЗапрос = Новый HTTPЗапрос(Источник);
			
	Ответ = Соединение.Получить(HTTPЗапрос); 
		
	Если Ответ.КодСостояния <> 200 Тогда
		
		ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации(ТекстОшибки); 
		
	КонецЕсли;
		
	Возврат Ответ;	
	
КонецФункции


