
&НаКлиенте
Процедура ВКМ_СписокСотрудниковВКМ_СотрудникПриИзменении(Элемент)
	
	РазмерПремии = ОпределитьРазмерПремии();
	
	Если Не ЗначениеЗаполнено(РазмерПремии) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Размер фиксированной премии не установлен";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ВКМ_СписокСотрудников.ТекущиеДанные;
	СтрокаТабличнойЧасти.ВКМ_СуммаПремии = РазмерПремии;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьРазмерПремии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ФиксированнаяПремияСрезПоследних.ВКМ_ФиксированнаяПремия КАК ФиксированнаяПремия
	|ИЗ
	|	РегистрСведений.ВКМ_ФиксированнаяПремия.СрезПоследних(&Период,) КАК ВКМ_ФиксированнаяПремияСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		РазмерПремии = Выборка.ФиксированнаяПремия ;
		
	КонецЕсли;
	
	Возврат РазмерПремии;

КонецФункции	
