
Перем СпециалистДокумента, ДатаДокумента, ДатаПроведенияРаботДокумента, ВремяНачалаРаботДокумента, ВремяОкончанияРаботДокумента ;
  
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК СпециалистДокумента,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК ДатаДокумента,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_ДатаПроведенияРабот КАК ДатаПроведенияРаботДокумента,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_ВремяНачалаРабот КАК ВремяНачалаРаботДокумента,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_ВремяОкончанияРабот КАК ВремяОкончанияРаботДокумента
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка );
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СпециалистДокумента = Выборка.СпециалистДокумента;
			ДатаДокумента = Выборка.ДатаДокумента;
			ДатаПроведенияРаботДокумента = Выборка.ДатаПроведенияРаботДокумента;
			ВремяНачалаРаботДокумента = Формат(Выборка.ВремяНачалаРаботДокумента, "ДЛФ=T;");
			ВремяОкончанияРаботДокумента = Формат(Выборка.ВремяОкончанияРаботДокумента, "ДЛФ=T;");		
			
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	СсылкаСтрока = Строка(Ссылка);
	
	Если ЭтоНовый() Тогда
		
		ТекстСообщения = СтрШаблон("Создана новая заявка.Дата выполнения : %1. Время начала : %2, время окончания : %3. 
		|Специалист : %4. Описание проблемы : %5", ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРабот, 
		ВКМ_ВремяОкончанияРабот, ВКМ_Специалист.ПолноеНаименование(), ВКМ_ОписаниеПроблемы );
		
		ЭлементСправочника = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
		ЭлементСправочника.ВКМ_ТекстСообщения = ТекстСообщения;
		ЭлементСправочника.Записать();
		
	Иначе
		
		Если СпециалистДокумента <> ВКМ_Специалист Тогда
		
			СпециалистИзменился = СтрШаблон("%1 : Специалист Изменился.Новый Специалист %2.", СсылкаСтрока, ВКМ_Специалист) ;
			
			ЭлементСправочника = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
			ЭлементСправочника.ВКМ_ТекстСообщения = СпециалистИзменился;
			ЭлементСправочника.Записать();
				
		КонецЕсли;
		
		Если ДатаДокумента <> Дата Тогда
		
			ДатаДокументаИзменилась = СтрШаблон("%1 : Дата документа изменилась.Новая дата %2.", СсылкаСтрока, Дата);
			
			ЭлементСправочника = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
			ЭлементСправочника.ВКМ_ТекстСообщения = ДатаДокументаИзменилась;
			ЭлементСправочника.Записать();
				
		КонецЕсли;
		
		Если ДатаПроведенияРаботДокумента <> ВКМ_ДатаПроведенияРабот Тогда
		
			ДатаПроведенияРаботИзменилась = СтрШаблон("%1 : Дата проведения работ изменилась.Новая дата проведения работ %2",
					 СсылкаСтрока , ВКМ_ДатаПроведенияРабот);
			
			ЭлементСправочника = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
			ЭлементСправочника.ВКМ_ТекстСообщения = ДатаПроведенияРаботДокумента;
			ЭлементСправочника.Записать();
				
		КонецЕсли;
		
		Если ВремяНачалаРаботДокумента <> ВКМ_ВремяНачалаРабот Тогда
		
			ВремяНачалаРаботИзменилось = СтрШаблон("%1 : Время начала работ изменилось.Новое время начала работ %2",
					СсылкаСтрока, ВКМ_ВремяНачалаРабот) ;
			
			ЭлементСправочника = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
			ЭлементСправочника.ВКМ_ТекстСообщения = ВремяНачалаРаботИзменилось;
			ЭлементСправочника.Записать();
				
		КонецЕсли;
		
		Если ВремяОкончанияРаботДокумента <> ВКМ_ВремяОкончанияРабот Тогда
		
			ВремяОкончанияРаботИзменилось = СтрШаблон("%1 : Время окончания работ изменилось.Новое время окончания работ %2",
					СсылкаСтрока , ВКМ_ВремяОкончанияРабот) ;
			
			ЭлементСправочника = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
			ЭлементСправочника.ВКМ_ТекстСообщения = ВремяОкончанияРаботИзменилось;
			ЭлементСправочника.Записать();
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Если ВКМ_Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Тект = "Выбран договор не включающий абонентскую плату.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Дата > ВКМ_Договор.ВКМ_ПериодДействияДоговора ИЛИ Дата < ВКМ_Договор.ВКМ_ДатаНачалаДействияДоговора Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Провести документ невозможно. Дата документа выходит за пределы действия договора." ;	
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;	 
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Для Каждого ТекСтрокаВКМ_ВыполнениеРаботы из ВКМ_ВыполнениеРаботы Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Клиент = ВКМ_Клиент;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_КоличествоЧасов = ТекСтрокаВКМ_ВыполнениеРаботы.ВКМ_ЧасыКОплатеКлиенту;
		Движение.ВКМ_СуммаКОплате = Движение.ВКМ_КоличествоЧасов * ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы ;
	
	КонецЦикла;
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник.Представление КАК СотрудникПредставление,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад КАК ВКМ_Оклад,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ВКМ_Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата );
	Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист );
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Если Не ЗначениеЗаполнено(Выборка.ПроцентОтРабот) Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Для сотрудника %1 не установлен процент оплаты.", Выборка.СотрудникПредставление);
			Сообщение.Сообщить();
			
			Отказ = Истина;		
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.ПроцентОтРабот) ИЛИ Выборка.ПроцентОтРабот = 0 Тогда
			
			Для Каждого ТекСтрокаВКМ_ВыполнениеРаботы из ВКМ_ВыполнениеРаботы Цикл
				
				Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение.Период = Дата;
				Движение.ВКМ_Сотрудник = ВКМ_Специалист;
				Движение.ВКМ_ЧасовКОплате = ТекСтрокаВКМ_ВыполнениеРаботы.ВКМ_ЧасыКОплатеКлиенту;
				
				Если Выборка.ПроцентОтРабот = 0 Тогда
					
					Движение.ВКМ_СуммаКОплате = 
						ТекСтрокаВКМ_ВыполнениеРаботы.ВКМ_ЧасыКОплатеКлиенту * ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы ;
					
				Иначе
					
					Движение.ВКМ_СуммаКОплате = 
						ТекСтрокаВКМ_ВыполнениеРаботы.ВКМ_ЧасыКОплатеКлиенту * ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы
						*Выборка.ПроцентОтРабот / 100 ;
						
				КонецЕсли;
				 	 			
			КонецЦикла;
			
			Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
			
		КонецЕсли;
				
	КонецЕсли;
		
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

