
&НаСервере
Функция ВКМ_АнализГрафикаНаСервере()
	
	ДанныеТаблицы = Объект.ВКМ_ОтпускаСотрудников.Выгрузить();
	ГодОтпусков = Объект.ВКМ_Год;
	
	Данные = Новый Массив;
	Данные.Добавить(ГодОтпусков);
	Данные.Добавить(ДанныеТаблицы);
	
	Адрес = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
	
	Возврат Адрес;
		
КонецФункции

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)
	
	
	
	Адрес = ВКМ_АнализГрафикаНаСервере();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", Адрес);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ВКМ_АнализГрафика", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончанияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВКМ_ОтпускаСотрудников.ТекущиеДанные;
	ДнейОтпуска = ПроверитьТекущуюСтроку(ТекущаяСтрока);
	ТекущаяСтрока.ВКМ_ДнейОтпуска = ДнейОтпуска;
	ТекущийСотрудник = ТекущаяСтрока.ВКМ_Сотрудник;
	СуммаДнейОтпуска = ПроверитьСуммуДнейОтпуска(ТекущийСотрудник);		

	Если СуммаДнейОтпуска > 28 Тогда
		 		
		//Не работает, выделяет цетом всю колонку
		Элемент.ЦветФона = WebЦвета.Красный;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "При выборе даты текущей строки количество дней отпуска превысило максимально разрешенное";
		Сообщение.Сообщить();
			
	Иначе 
		 
		Элемент.ЦветФона = WebЦвета.Белый;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаНачалаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВКМ_ОтпускаСотрудников.ТекущиеДанные;
	ДнейОтпуска = ПроверитьТекущуюСтроку(ТекущаяСтрока);
	ТекущаяСтрока.ВКМ_ДнейОтпуска = ДнейОтпуска;
	ТекущийСотрудник = ТекущаяСтрока.ВКМ_Сотрудник;
	СуммаДнейОтпуска = ПроверитьСуммуДнейОтпуска(ТекущийСотрудник);
	
	Если СуммаДнейОтпуска > 28 Тогда
		 		
		//Не работает, выделяет цетом всю колонку
		Элемент.ЦветФона = WebЦвета.Красный;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "При выборе даты текущей строки количество дней отпуска превысило максимально разрешенное";
		Сообщение.Сообщить();
		
	Иначе 
		 
		Элемент.ЦветФона = WebЦвета.Белый; 
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_СотрудникПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВКМ_ОтпускаСотрудников.ТекущиеДанные;
	ТекущаяСтрока.ВКМ_ДатаНачала = Неопределено;
	ТекущаяСтрока.ВКМ_ДатаОкончания = Неопределено;
	ТекущаяСтрока.ВКМ_ДнейОтпуска = 0;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьТекущуюСтроку(ТекущаяСтрока)
	
	ДнейОтпуска = (ТекущаяСтрока.ВКМ_ДатаОкончания - ТекущаяСтрока.ВКМ_ДатаНачала ) / 86400 ;
	
	Возврат ДнейОтпуска;		
	
КонецФункции

&НаКлиенте
Функция ПроверитьСуммуДнейОтпуска(Сотрудник)
	
	//на мой взгляд не очень оптимальное решение с точки зрения загрузки производительности системы
	//но через НайтиСтроки() не получается сделать
	КоличествоСтрокТЧ = Объект.ВКМ_ОтпускаСотрудников.Количество();
	
	СуммаДнейОтпуска = 0;
	
	Для Сч = 1 По КоличествоСтрокТЧ Цикл
		
		СтрокаТЧ = Объект.ВКМ_ОтпускаСотрудников[Сч - 1];
		
		Если СтрокаТЧ.ВКМ_Сотрудник <> Сотрудник Тогда
			
			Продолжить;
			
		Иначе
				
			СуммаДнейОтпуска = СуммаДнейОтпуска + СтрокаТЧ.ВКМ_ДнейОтпуска;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СуммаДнейОтпуска;
	
КонецФункции



