
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РазмерНДФЛ = Константы.ВКМ_РазмерНДФЛ.Получить();
	
	Если Не ЗначениеЗаполнено(РазмерНДФЛ) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не установлено значение НДФЛ.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ВКМ_СписокСотрудников Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ФиксированнаяПремия;
		Движение.ВКМ_Сотрудник = СтрокаТЧ.ВКМ_Сотрудник;
		Движение.ВКМ_Результат = СтрокаТЧ.ВКМ_СуммаПремии;
		
		РазмерУдержания = РасчитатьНДФЛ(СтрокаТЧ.ВКМ_Сотрудник, СтрокаТЧ.ВКМ_СуммаПремии, РазмерНДФЛ);
		
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.Период = Дата;
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчеты.ВКМ_Сотрудник = СтрокаТЧ.ВКМ_Сотрудник;
		ДвижениеВзаиморасчеты.ВКМ_Сумма = Движение.ВКМ_Результат - РазмерУдержания ;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		
КонецПроцедуры

Функция РасчитатьНДФЛ(Сотрудник, СуммаПремии, РазмерНДФЛ)
	
	Движение = Движения.ВКМ_Удержания.Добавить();
	Движение.ПериодРегистрации = Дата;
	Движение.ВКМ_Сотрудник = Сотрудник;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
	Движение.ВКМ_Значение = РазмерНДФЛ;	
	Движение.ВКМ_Результат = СуммаПремии * 13 /100 ;
	
	Движения.ВКМ_Удержания.Записать();
	
	Возврат Движение.ВКМ_Результат;	
	
КонецФункции
 
