
&НаКлиенте
Процедура ВКМ_ВыплатыВКМ_СотрудникПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ВКМ_Выплаты.ТекущиеДанные;
	
	СуммаКВыплате = ОпределитьСуммуВыплаты(СтрокаТЧ.ВКМ_Сотрудник);
	
	Если Не ЗначениеЗаполнено(СуммаКВыплате) Тогда
	
		СтрокаТЧ.ВКМ_Сумма = 0;	
		
	Иначе
						
		СтрокаТЧ.ВКМ_Сумма = СуммаКВыплате;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ОпределитьСуммуВыплаты(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ВКМ_Сотрудник = &Сотрудник) КАК
	|		ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата) );
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник );
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаОстаток = 0;
	
	Пока Выборка.Следующий() Цикл
		
		СуммаОстаток = СуммаОстаток + Выборка.СуммаОстаток;
		
	КонецЦикла;
	
	Возврат СуммаОстаток;
	
КонецФункции
