
Функция ЗаполнитьСписокДоговоров(СписокДоговоров, Период) Экспорт
	
	ЕстьРеализации = ПроверитьРеализацииНаПериод(Период);
	
	Если ЕстьРеализации Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Реализации за данный период созданы" ;
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СписокДоговоров.Количество() > 0 Тогда
		
		СозданныхДокументов = 0;
		
		Для Каждого Договор Из СписокДоговоров Цикл
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = Период;
			НовыйДокумент.Договор = Договор;
			НовыйДокумент.Контрагент = Договор.Владелец;
			
			ЗаполнитьЗначенияСвойств(НовыйДокумент, Договор);
			
			НовыйДокумент.ВыполнитьАвтозаполнение(); 
			
			Если Не НовыйДокумент.ПроверитьЗаполнение() Тогда
				
				Возврат Ложь;
				
			КонецЕсли;
			
			НовыйДокумент.Записать();
			
			СозданныхДокументов = СозданныхДокументов + 1;
		
		КонецЦикла;
		
		КоличествоСозданныхДокументов = СтрШаблон("Количество созданных документов : %1", СозданныхДокументов);
		
		Возврат КоличествоСозданныхДокументов;				
		
	КонецЕсли;
		
КонецФункции

Функция ПроверитьРеализацииНаПериод(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &Период
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Период", Месяц(Период));	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//СписокРеализаций = Новый Массив;
	
	Если Выборка.Следующий Тогда
		
		Возврат Истина;
		
	Иначе
			
		Возврат Ложь;
					
	КонецЕсли;
		
КонецФункции

