
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	ВКМ_УправлениеВидимостьюЭлементов();	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементПериодДействияДоговора = Элементы.Добавить("ВКМ_ПериодДействияДоговора", Тип("ПолеФормы"));
	ЭлементПериодДействияДоговора.ПутьКДанным = "Объект.ВКМ_ПериодДействияДоговора";
	ЭлементПериодДействияДоговора.Заголовок = "Действует до :";
	ЭлементПериодДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементСтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ЭлементСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ЭлементСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
	ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ЭлементСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
	ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	
	ВКМ_УправлениеВидимостьюЭлементов();			
			
КонецПроцедуры

Процедура ВКМ_УправлениеВидимостьюЭлементов()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание  Тогда
		
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_ПериодДействияДоговора.Видимость = Истина;
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе 
			
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_ПериодДействияДоговора.Видимость = Ложь;
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		
	КонецЕсли;
			
КонецПроцедуры



				
	


