
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Период.ДатаНачала = НачалоГода(Данные[0]);
	Период.ДатаОкончания = КонецГода(Данные[0]);
	
	ТаблицаГрафикаОтпусков = Данные[1];
	
	ДиаграммаГанта.Очистить();
	
	Для Каждого Строка Из ТаблицаГрафикаОтпусков Цикл
	
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.ВКМ_Сотрудник);
		Точка.Текст = Строка.ВКМ_Сотрудник;
		
		Серия = ДиаграммаГанта.УстановитьСерию(Строка.ВКМ_Сотрудник);
		Серия.Текст = Строка.ВКМ_Сотрудник;	
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия );
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ВКМ_ДатаНачала;
		Интервал.Конец = Строка.ВКМ_ДатаОкончания;	
		
	КонецЦИкла;
	
КонецПроцедуры

